# SQL Statement Fundamentals

## SELECT

### Basic format
SELECT column1,column2,... FROM table_name
- Query data from all columns: SELECT * (only for use when handling small databases)

#### Select all columns within a table

- Click 'lightening symbol' to open the database
- Write SELECT  *  FROM actor;
    - Actor is one of the tables
        - Found within the current database using: database_name > Schemas > Tables > table_name 
    - Insert ";" at end to end the query

#### Select specific column(s) within a table

- Click 'lightening symbol' to open the database
- Write:

SELECT  first_name,last_name <br>
FROM actor;

## SELECT DISTINCT
- Check for distinct values with a column, of a database

SELECT DISTINCT release_year <br>
FROM film;

## SELECT WHERE
- Filter the rows returned form the SELECT statement

SELECT coloumn1, coloumn2... coloumn_n <br>
FROM TABLE <br>
WHERE conditions;

Get all the customers whose first names are Jamie
- HINT: Use the WHERE clause with the equal (=) operator as follows:

SELECT last_name, first_name FROM customer  <br>
WHERE first_name = 'Jamie';

Select the customer's names whose first name is Jamie and the last name is Rice
- HINT: Use the AND logical operaor to combines the two conditions:

SELECT last_name, first_name FROM customer  <br>
WHERE first_name = 'Jamie' AND last_name = 'Rice';

Return who paid a rental amount less than or equal to 1 USD or more than and equal to 8 USD
- HINT: Use the OR logical operaor and the less than <= and more than >= operators

SELECT customer_id,amount,payment_date <br>
FROM payment <br>
WHERE amount <= 1 OR amount >= 8;

## COUNT
- Returns the number of rows that matches a specific condition, of the query

Format: <br>
SELECT COUNT(*) FROM table

- Count the number of rows within a specific column: <br>
SELECT COUNT(column) FROM table; <br>
<br>
- E.g: <br>
SELECT COUNT(*) FROM payment;

- Count the number of distinct rows within a specific column: <br>
SELECT COUNT(DISTINCT column) FROM table; <br>
<br>
- E.g: <br>
SELECT COUNT(DISTINCT amount) FROM payment;
    - A specific column name must be specifed

## LIMIT
- Allows you to limit the number of rows you get back after a query
    - Useful when you need to see all the coloumns but not all the rows
- Goes at the end of the query

- E.g Display the first 5 rows from the customer table: <br>
<br>
SELECT * FROM customer <br>
LIMIT 5

## ORDER BY
- When queriying data from a table, the rows are returned by insertion order
- To sort the result-set use the ORDER BY clause in the SELECT statement
- The ascending or descending order can be specified by coloumn

- Sort column_1 and column_2 from table_name into an ascending order using column_1:

SELECT column1,column2 FROM table_name <br>
ORDER BY column_1 ASC;

- Sort column_1 and column_2 from table_name into a descending order using column_1:

SELECT column1,column2 FROM table_name <br>
ORDER BY column_1 DESC;

- Sort first_name and last_name from customer into an ascending order using first_name: <br> 
<br>
SELECT * FROM customer <br>
ORDER BY first_name ASC;

- Sort the result of the query above by last_name in descending order
    - The first column will be in ascending order, the second column will be in descending order as long as the items in the first column are still in ascending order <br>

SELECT * FROM customer <br>
ORDER BY first_name ASC, last_name DESC;

- List the top ten highest paying customers IDs: <br>
<br>
SELECT customer_id, amount FROM payment <br>
ORDER BY amount DESC <br>
LIMIT 10

## BETWEEN
- To match value against a range of values 
- Format: <br>
value BETWEEN low AND high <br>
or <br>
value NOT BETWEEN low AND high <br>
or <br>
value >= low AND value <= high;

- List the customers IDs for payments between 8 and 9USD: <br>
<br>
SELECT customer_id,amount FROM payment <br>
WHERE amount BETWEEN 8 AND 9;

- List the customers IDs for payments not between 8 and 9USD: <br>
<br>
SELECT customer_id,amount FROM payment <br>
WHERE amount NOT BETWEEN 8 AND 9;

- Payments between a range of dates: <br>
<br>
SELECT amount, payment date FROM payment <br>
WHERE payment_date BETWEEN '2007-02-07' AND '2007-02-15';

# IN
- Use with the WHERE clause to check if a value matches any value in a list of values
- Format: <br>
value IN (value1,value2,...)
- Can also be in the result of a SELECT statement (sub-query): <br>
value IN (SELECT value FROM tbl_name)
- Not IN: <br>
value NOT IN (value1,value2,value3,,...)
- A quick way of writing OR statements

- Customer IDs from the retal table, that are 1 or a 2: <br>
<br>
SELECT customer_id,rental_id,return_date <br>
FROM rental <br>
WHERE customer_id IN (1,2) <br>
ORDER BY return_date DESC;

- Customer IDs from the retal table, that are not 1 or a 2: <br>
<br>
SELECT customer_id,rental_id,return_date <br>
FROM rental <br>
WHERE customer_id NOT IN (1,2) <br>
ORDER BY return_date DESC;

- Customer IDs from the retal table, that are 7,13 or 10: <br>
<br>
SELECT customer_id,rental_id,return_date <br>
FROM rental <br>
WHERE customer_id IN (7,13,10) <br>
ORDER BY return_date DESC;

- All the rental prices when the price is either 7.99 or 8.99USD: <br>
<br>
SELECT * FROM payment<br>
WHERE amount IN (7.99,8.99);

# LIKE
- Use of complete pattern matching of inforamtion fields
    - Search with only partial knowledge of the data within the chosen field
- Format: <br>
WHERE first_name LIKE 'Jen%'
- Use % for matching any sequence of characters
- Use _ for matching any single character

- Search for all the first names that start with "Jen": <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name LIKE 'Jen%';

- Search for all the first names ending with a "y": <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name LIKE '%y';

- Search for all the first names with "er" somewhere within the first name: <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name LIKE '%er%';

- Search for all the first names where after the first character the next 3 letters are "her" follwed by any sequence of letters, irrespective of length: <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name LIKE '_her%';

- Search for all the first names that do not start with "Jen": <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name NOT LIKE 'Jen%';

- Search for all the first names that startwith "Bar" without considering case: <br>
<br>
SELECT first_name,last_name <br>
FROM customer <br>
WHERE first_name NOT ILIKE 'Bar%';